
Start a mongdb
#+BEGIN_SRC sh
brew services start mongodb
#+END_SRC

#+RESULTS:
| Service `mongodb` already started | use `brew services restart mongodb` to restart. |


#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name "."))
(require 'ffi)

(define-ffi-library mongoc "libmongoc")
#+END_SRC

#+RESULTS:
: mongoc

#+BEGIN_SRC emacs-lisp
(define-ffi-function mongoc-init "mongoc_init" :void nil mongoc)
(define-ffi-function mongoc-cleanup "mongoc_cleanup" :void nil mongoc)
#+END_SRC

#+RESULTS:
: mongoc-cleanup



#+RESULTS:
: mongoc_collection_insert

Now we try using these:

#+BEGIN_SRC emacs-lisp
(mongoc-init)


(with-ffi-strings ((uri "mongodb://localhost:27017")
		   (dbname "db_name")
		   (collname "coll_name"))
  
  (let* ((client (mongoc-client-new uri))
	 (db (mongoc-client-get-database client dbname))
	 (collection (mongoc-client-get-collection client dbname collname)))

    collection

    

    
    ))

(mongoc-cleanup)
#+END_SRC


